#+TITLE: Ready-made Flask virtualenv
#+LANGUAGE: en
#+PROPERTY: header-args:python :tangle lib/flask_venv.py
#+PROPERTY: header-args:bash   :tangle no :dir (expand-file-name ".." default-directory) :results verbatim :cache yes

I often build small Flask APIs. Instead of repeating the venv setup in
every project, I want a pre-built virtualenv with Flask installed that
I can copy into my final image.

#+begin_src python
import dagger
from dagger import function
#+end_src

* A Flask virtualenv as a directory artifact

  This returns the =/app/venv= directory with Flask (and optional extra
  packages) already installed. I can then copy this into any container.

  [[https://docs.dagger.io/api/reference#definition-Container][.directory(path)]] extracts a directory from the container as a
  [[https://docs.dagger.io/api/reference#definition-Directory][Directory]] artifact. Here it pulls out the fully-built virtualenv so
  it can be copied into a different, leaner final image without
  repeating the install steps.

  #+begin_src python
  @function
  def flask_venv(self, pip_packages: list[str] = ()) -> dagger.Directory:
      """Debian python user venv with flask, exported as directory artifact."""
      ctr = self.debian_python_user_venv(pip_packages=["flask"] + list(pip_packages))
      return ctr.directory("/app/venv")
  #+end_src

  #+NAME: flask_venv_export
  #+begin_src bash :tangle (daggerlib-tangle-test "flask_venv_export") :comments no :padline no
  TMP="${TMP:-$(mktemp -d)}"
  dagger call flask-venv export --path="$TMP/out" > /dev/null
  test -f "$TMP/out/bin/flask" && echo "bin/flask exists"
  #+end_src

  #+RESULTS[6123a8c74ceb95e4bfac6cd2efcd09340ff2c912]: flask_venv_export
  : bin/flask exists

  #+BEGIN_SRC org :tangle (daggerlib-tangle-expected "flask_venv_export") :noweb yes :exports none :comments no :padline no
  <<flask_venv_export()>>
  #+END_SRC
